app/controllers/products_controller.rb

  def index
    @filterrific = initialize_filterrific(
      Product,
      params[:filterrific],
      select_options: {
        sorted_by: Product.options_for_sorted_by,
        with_category_id: Category.all.map { |c| [c.name, c.id] }
      }
    ) or return
---
SELECT "categories".* FROM "categories"
SELECT "products".* FROM "products"

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "desc", "price", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "s"], ["desc", "a"], ["price", "43.0"], ["category_id", 4], ["created_at", "2023-03-07 08:41:40.812673"], ["updated_at", "2023-03-07 08:41:40.812673"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "name" = $1, "desc" = $2, "price" = $3, "updated_at" = $4 WHERE "products"."id" = $5  [["name", "Lenovo"], ["desc", "Core i3 12gen"], ["price", "280.0"], ["updated_at", "2023-03-09 12:27:27.555724"], ["id", 2]]