app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "address", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "zxc"], ["last_name", "zxc"], ["address", "cxz"], ["email", "zxc"], ["created_at", "2023-03-06 14:09:44.718778"], ["updated_at", "2023-03-06 14:09:44.718778"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "address" = $3, "email" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["first_name", "Anas"], ["last_name", "Abuobaid"], ["address", "Amman"], ["email", "anas@gmail.com"], ["updated_at", "2023-03-09 12:33:40.511125"], ["id", 1]]